s_8 = {
    "26.10.24": "Физика",
    "07.12.24": "Физика",
    "26.12.24": "Алгебра",
    "15.02.25": "Физика",
    "19.04.25": "Физика",
    "15.05.25": "Алгебра",
    "19.05.25": "Геометрия",
    "20.05.25": "Русский"
}

s_9 = {
    "28.10.24": "Геометрия",
    "05.11.24": "Физика",
    "17.12.24": "Физика",
    "14.02.25": "Алгебра",
    "01.03.25": "Русский",
    "18.03.25": "Физика",
}

s_10 = {
    "21.10.24": "Геометрия (М-10-2, М-10-3)",
    "23.10.24": "Геометрия (М-10-1)",
    "20.11.24": "Физика",
    "22.11.24": "Информатика",
    "09.12.24": "Литература (А-10-2, А-10-3)",
    "10.12.24": "Литература (А-10-1)",
    "14.12.24": "Алгебра",
    "01.02.25": "Алгебра",
    "07.02.25": "Русский",
    "12.02.25": "Физика",
    "14.02.25": "Информатика",
    "26.04.25": "Алгебра",
    "30.04.25": "Физика",
    "14.05.25": "Алгебра",
    "21.05.25": "Геометрия",
    "23.05.25": "Информатика"
}

s_11 = {
    "26.10.24": "Физика",
    "23.11.24": "Алгебра",
    "03.12.24": "Информатика",
    "21.12.24": "Физика",
    "15.03.25": "Физика"
}